posts/prospr.html
title: Working with ProSPr: Protein Structure Prediction
date: 2020-12-31 20:00
tags: bar
recent: t
status: Completed
purpose: Learn more about protein structure prediction
---

<div id="outline-container-org8a43788" class="outline-2">
<h2 id="org8a43788">Summary</h2>
<div class="outline-text-2" id="text-org8a43788">
<p>
After seeing news about Alphafold2, I wanted to try playing with it and maybe
using it to predict the structure of a protein. Unfortunately, the Alphafold2
code was not available at the time, so I chose to play with <a href="https://github.com/dellacortelab/prospr/">ProSPr</a>. I eventually
completed that structure prediction after some troubleshooting, and I
contributed a small fix to the project along the way.
</p>
</div>
</div>

<div id="outline-container-orgd986ebf" class="outline-2">
<h2 id="orgd986ebf">Lessons Learned</h2>
<div class="outline-text-2" id="text-orgd986ebf">
<ul class="org-ul">
<li>Making another open source contribution.</li>
<li>How to use docker</li>
</ul>
</div>
</div>
